# SetValues Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElectricalDemandFactorDefinition..::..SetValues Method
ElectricalDemandFactorDefinition Class See Also
---
Sets the value set to the demand factor definition.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public void SetValues(
	ICollection<ElectricalDemandFactorValue> values
)
```

Visual Basic
---
```text
Public Sub SetValues ( _
	values As ICollection(Of ElectricalDemandFactorValue) _
)
```

Visual C++
---
```text
public:
void SetValues(
	ICollection<ElectricalDemandFactorValue^>^ values
)
```

# ### Parameters
values
    Type: System.Collections.Generic..::..ICollection<(Of <(<'ElectricalDemandFactorValue>)>)>
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ElectricalDemandFactorDefinition Class
Autodesk.Revit.DB.Electrical Namespace